In [1]:
import pandas as pd
# There are two main data types: Series and DataFrames.
series = pd.Series(["BMW", "Toyota", "Honda"])

In [2]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [3]:
# series are 1-dimensional. They have only one column.

In [4]:
colours = pd.Series(['Red', 'Blue', 'White'])
colours

0      Red
1     Blue
2    White
dtype: object

In [5]:
secondary_school_classmates = pd.Series(["Mark Odaudu","Emma Anashie","Hauwa Musa","Abu","Joseph","Faiza","Kenret","Happy","Victoria","Amenger","Happiness","Precious"])
secondary_school_classmates

0      Mark Odaudu
1     Emma Anashie
2       Hauwa Musa
3              Abu
4           Joseph
5            Faiza
6           Kenret
7            Happy
8         Victoria
9          Amenger
10       Happiness
11        Precious
dtype: object

In [6]:
university_classmates = pd.Series(["Abiodun","Hakeem","Yuguda","Joel","Mujeeb","Chris","Khamis","Ope","Sir Peter","Valentina"])
university_classmates

0      Abiodun
1       Hakeem
2       Yuguda
3         Joel
4       Mujeeb
5        Chris
6       Khamis
7          Ope
8    Sir Peter
9    Valentina
dtype: object

In [7]:
# DataFrames are 2-dimensional. They have more than one column.

In [8]:
car_data = pd.DataFrame({"Car make": series, "Colour": colours})
car_data

  Car make Colour
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [9]:
friends = pd.DataFrame({"University Friends": university_classmates, "Secondary School Friends": secondary_school_classmates})
friends

   University Friends Secondary School Friends
0             Abiodun              Mark Odaudu
1              Hakeem             Emma Anashie
2              Yuguda               Hauwa Musa
3                Joel                      Abu
4              Mujeeb                   Joseph
5               Chris                    Faiza
6              Khamis                   Kenret
7                 Ope                    Happy
8           Sir Peter                 Victoria
9           Valentina                  Amenger
10                NaN                Happiness
11                NaN                 Precious

In [10]:
# import data
sauce = pd.Series(["stew", "onion", "egg sauces", "egg", "butter", "stew", "rice", "rolls", "tea", "pawpaw"])
sauce

0          stew
1         onion
2    egg sauces
3           egg
4        butter
5          stew
6          rice
7         rolls
8           tea
9        pawpaw
dtype: object

In [11]:
#To view jupyter notebook path
import os
os.getcwd()

'C:\\Users\\DELL\\OneDrive\\Desktop\\sample_project_1\\env'

In [12]:
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [13]:
#Exporting a DataFrame
car_sales.to_csv("exported-car-sales.csv")

## Describe data - This is a markdown (Research markdowns)

In [14]:
#How to describe data types.

# 1. Attribute - They don't have brackets. 
car_sales.dtypes

# 2. Function - They have brackets.
# car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [15]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [16]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [17]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [18]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [19]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [23]:
car_sales.mean(numeric_only=True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [22]:
car_prices = pd.Series([3000, 1500, 111250])
car_prices.mean()

np.float64(38583.333333333336)

In [24]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [25]:
car_sales["Doors"].sum()

np.int64(40)

In [26]:
len(car_sales)

10